//
//  CopyrightStatementViewModel.swift
//  Diary
//
//  Created by 谷粒公社 on 2019/6/24.
//  Copyright © 2019 lcz. All rights reserved.
//

import Foundation

class CopyrightStatementViewModel {
    let contentString = """
    \(LCZAppName)一贯高度重视知识产权保护并遵守中华人民共和国各项知识产权法律、法规和具有约束力的规范性文件,充分尊重和保护权利人的合法权利，\(LCZAppName)根据我国相关法律法规的规定，特制定本声明。如果您认为\(LCZAppName)呈现的相关内容侵犯了您的合法权益，请您通过\(LCZAppName)中的邮件反馈渠道或邮箱：【\(AppEmail)】与\(LCZAppName)取得联系，向\(LCZAppName)提交书面权利通知书，通知书的内容应包括但不限于以下内容：
    1、您的名称（姓名）及身份证明（包括身份证、营业执照等有效身份证件）、联系方式（含Email地址）及地址；
    2、明确要求删除或者断开链接内容的准确名称和网络地址。
    3、构成侵权地初步证明材料。该初步证明材料应包括：
        (1)您拥有权利的权属证明材料，包括但不限于相关有权机构颁发的证书、作品首次公开发表或发行日期证明材料、创作手稿等能证明权利人拥有相关权利的有效权属证明；
        (2)如为授权取得，您还需提供完整的授权文件；
        (3)被投诉内容构成侵权的证明：包括但不限于被投诉方内容构成对权利人的商标、专利、名誉等合法权益侵犯的有效证明等。您应保证您在通知书中的陈述和提供的相关材料皆是真实、有效和合法的，且您承诺承担如\(LCZAppName)根据您的通知而删除或断开有关涉嫌侵权内容的链接而给\(LCZAppName)造成的损失，包括但不限于因此向被投诉方支付的损失赔偿以及\(LCZAppName)的商誉损害等。一旦收到符合上述要求之通知，\(LCZAppName)会尽快按照相关法律法规的规定进行处理，包括删除、断开链接等相应措施。如不符合上述条件，我们会请您补充提供相应信息，且暂不采取包括删除等相应措施。
    """
}
